# Copyright 2024, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

# Florence2 Triton Ensemble
#
# Pipeline:
#   Client → preprocessing → vision → tensorrt_llm → postprocessing → Client
#
# The preprocessing step tokenizes the task prompt and constructs virtual
# token IDs for the DaViT image positions. The vision step runs the DaViT
# TRT engine to produce image_features as prompt_embedding_table. The
# tensorrt_llm step runs the BART encoder/decoder via the C++ tensorrtllm
# backend with inflight batching for concurrent request processing. The
# postprocessing step decodes output tokens and optionally applies Florence2
# structured output parsing.

name: "ensemble"
platform: "ensemble"
max_batch_size: 0

input [
    {
        name: "text_input"
        data_type: TYPE_STRING
        dims: [ 1, 1 ]
    },
    {
        name: "image_bytes_input"
        data_type: TYPE_UINT8
        dims: [ -1 ]
        optional: true
    },
    {
        name: "image_url_input"
        data_type: TYPE_STRING
        dims: [ 1, 1 ]
        optional: true
    }
]
output [
    {
        name: "text_output"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

ensemble_scheduling {
    step [
        # Step 1: Preprocessing — image loading, tokenization, virtual token IDs
        {
            model_name: "preprocessing"
            model_version: -1
            input_map {
                key: "QUERY"
                value: "text_input"
            }
            input_map {
                key: "IMAGE_BYTES"
                value: "image_bytes_input"
            }
            input_map {
                key: "IMAGE_URL"
                value: "image_url_input"
            }
            output_map {
                key: "PIXEL_VALUES"
                value: "_PIXEL_VALUES"
            }
            output_map {
                key: "OUT_PROMPT_VOCAB_SIZE"
                value: "_PROMPT_VOCAB_SIZE"
            }
            output_map {
                key: "INPUT_ID"
                value: "_INPUT_ID"
            }
            output_map {
                key: "REQUEST_INPUT_LEN"
                value: "_REQUEST_INPUT_LEN"
            }
            output_map {
                key: "DECODER_INPUT_ID"
                value: "_DECODER_INPUT_ID"
            }
            output_map {
                key: "REQUEST_DECODER_INPUT_LEN"
                value: "_REQUEST_DECODER_INPUT_LEN"
            }
            output_map {
                key: "REQUEST_OUTPUT_LEN"
                value: "_REQUEST_OUTPUT_LEN"
            }
            output_map {
                key: "OUT_END_ID"
                value: "_OUT_END_ID"
            }
            output_map {
                key: "OUT_PAD_ID"
                value: "_OUT_PAD_ID"
            }
            output_map {
                key: "BEAM_WIDTH"
                value: "_BEAM_WIDTH"
            }
            output_map {
                key: "NO_REPEAT_NGRAM_SIZE"
                value: "_NO_REPEAT_NGRAM_SIZE"
            }
            output_map {
                key: "LEN_PENALTY"
                value: "_LEN_PENALTY"
            }
        },
        # Step 2: Vision — DaViT TRT engine → image_features as prompt_embedding_table
        {
            model_name: "vision"
            model_version: -1
            input_map {
                key: "pixel_values"
                value: "_PIXEL_VALUES"
            }
            output_map {
                key: "image_features"
                value: "_PROMPT_EMBEDDING_TABLE"
            }
        },
        # Step 3: TensorRT-LLM — BART encoder/decoder TRT engines
        {
            model_name: "tensorrt_llm"
            model_version: -1
            input_map {
                key: "input_ids"
                value: "_INPUT_ID"
            }
            input_map {
                key: "input_lengths"
                value: "_REQUEST_INPUT_LEN"
            }
            input_map {
                key: "decoder_input_ids"
                value: "_DECODER_INPUT_ID"
            }
            input_map {
                key: "decoder_input_lengths"
                value: "_REQUEST_DECODER_INPUT_LEN"
            }
            input_map {
                key: "request_output_len"
                value: "_REQUEST_OUTPUT_LEN"
            }
            input_map {
                key: "end_id"
                value: "_OUT_END_ID"
            }
            input_map {
                key: "pad_id"
                value: "_OUT_PAD_ID"
            }
            input_map {
                key: "beam_width"
                value: "_BEAM_WIDTH"
            }
            input_map {
                key: "no_repeat_ngram_size"
                value: "_NO_REPEAT_NGRAM_SIZE"
            }
            input_map {
                key: "len_penalty"
                value: "_LEN_PENALTY"
            }
            input_map {
                key: "prompt_embedding_table"
                value: "_PROMPT_EMBEDDING_TABLE"
            }
            input_map {
                key: "prompt_vocab_size"
                value: "_PROMPT_VOCAB_SIZE"
            }
            output_map {
                key: "output_ids"
                value: "_TOKENS_BATCH"
            }
            output_map {
                key: "sequence_length"
                value: "_SEQUENCE_LENGTH"
            }
        },
        # Step 4: Postprocessing — token decode + Florence2 structured output parsing
        {
            model_name: "postprocessing"
            model_version: -1
            input_map {
                key: "TOKENS_BATCH"
                value: "_TOKENS_BATCH"
            }
            input_map {
                key: "SEQUENCE_LENGTH"
                value: "_SEQUENCE_LENGTH"
            }
            input_map {
                key: "TASK_QUERY"
                value: "text_input"
            }
            output_map {
                key: "OUTPUT"
                value: "text_output"
            }
        }
    ]
}
